In [1]:
import numpy as np
import pandas as pd

#

## series from list

In [2]:
my_index = ['USA','Canada', 'Mexico']
my_data = [1770,1867,1821]
my_series= pd.Series(data=my_data, index=my_index)
my_series

USA       1770
Canada    1867
Mexico    1821
dtype: int64

## serise from dictionry

In [3]:
ages = {'Sammy':5 , 'Frank':10 , 'Spike':7}
ages_serie = pd.Series(ages)
ages_serie

Sammy     5
Frank    10
Spike     7
dtype: int64

In [4]:
ages_serie.keys()

Index(['Sammy', 'Frank', 'Spike'], dtype='object')

In [5]:
ages_serie.values

array([ 5, 10,  7], dtype=int64)

In [6]:
ages_serie['Frank']=8

In [7]:
ages_serie

Sammy    5
Frank    8
Spike    7
dtype: int64

In [8]:
q1={'Japan':80 , 'China':450 , 'India':200 , 'USA':260}
q2={'Berezil':100 , 'China':500 , 'India':210 , 'USA':260}
sales_Q1= pd.Series(q1)
sales_Q2= pd.Series(q2)

In [9]:
sales_Q1.add(sales_Q2 , fill_value=0)

Berezil    100.0
China      950.0
India      410.0
Japan       80.0
USA        520.0
dtype: float64

# data frame

In [10]:
np.random.seed(101)
my_data=np.random.randint(0,101,(4,3))
my_data

array([[95, 11, 81],
       [70, 63, 87],
       [75,  9, 77],
       [40,  4, 63]])

In [11]:
my_index=['CA','NY','AZ','TX']
my_columns=['Jan','Feb','Mar']

In [12]:
df = pd.DataFrame(data=my_data, index=my_index, columns=my_columns)
df

    Jan  Feb  Mar
CA   95   11   81
NY   70   63   87
AZ   75    9   77
TX   40    4   63

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, CA to TX
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Jan     4 non-null      int32
 1   Feb     4 non-null      int32
 2   Mar     4 non-null      int32
dtypes: int32(3)
memory usage: 80.0+ bytes

# خواندن فایل های داده(csv,excel,html,xlsx) در jupeter

In [15]:
! pip install xlrd
! pip install openpyxl

Requirement already satisfied: xlrd in c:\programdata\anaconda3\lib\site-packages (2.0.1)
Requirement already satisfied: openpyxl in c:\programdata\anaconda3\lib\site-packages (3.0.10)
Requirement already satisfied: et_xmlfile in c:\programdata\anaconda3\lib\site-packages (from openpyxl) (1.1.0)

In [2]:
df=pd.read_csv('tips.csv')
df

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672

## pwd & ls

In [3]:
pwd

'C:\\Users\\Hasan\\pythonProject'

In [4]:
ls

 Volume in drive C is Win...10
 Volume Serial Number is 12AD-FCC9

 Directory of C:\Users\Hasan\pythonProject

09/08/2024  08:50 AM    <DIR>          .
09/08/2024  08:50 AM    <DIR>          ..
08/18/2024  12:00 PM    <DIR>          .idea
08/14/2024  12:31 PM    <DIR>          .ipynb_checkpoints
05/17/2024  08:06 PM    <DIR>          __pycache__
08/05/2024  08:24 AM            70,782 arrow_library.ipynb
07/02/2024  11:02 AM        30,927,045 balance-of-payments.csv
05/19/2024  03:52 PM               900 binary code.ipynb
04/20/2024  10:52 AM                42 cap.py
04/20/2024  10:39 AM               634 cap_test.py
05/18/2024  11:27 PM            38,092 class & inheritance.ipynb
07/02/2024  11:31 AM             4,620 CSV(comma seprate value) & PDF.ipynb
07/07/2024  11:38 AM            25,618 decorator.ipynb
04/20/2024  10:41 AM            11,918 exception error.ipynb
05/18/2024  10:27 PM    <DIR>          file
07/08/2024  10:54 AM             4,413 GUI(Graphic User Interface).ipynb
06/26/2024  08:44 AM             4,188 lock.png
05/19/2024  03:53 PM        21,504,192 me.ts
05/17/2024  08:07 PM               377 my_decorator.py
03/27/2024  02:08 AM    <DIR>          myModules
04/27/2024  12:20 PM            33,577 numpy Library.ipynb
04/27/2024  07:35 PM            16,824 Our years OLd.xlsx
09/08/2024  08:50 AM            50,255 pandas library.ipynb
03/27/2024  02:37 AM    <DIR>          pkg
07/02/2024  12:35 PM             8,580 RegularExpressions.ipynb
08/03/2024  12:11 PM            23,824 requirements.txt
05/19/2024  03:39 PM        21,504,192 Rex.ts
04/02/2024  05:19 PM                35 simple1.py
08/10/2024  10:22 AM            16,200 source codes.ipynb
08/17/2024  11:01 AM             9,152 SQlite3.ipynb
08/16/2024  05:17 PM            12,288 test_data.db
01/18/2023  01:01 PM       142,550,338 The.Boss.Baby.2017_1.mp3
03/24/2024  04:52 AM             9,066 tic_toc_toe.ipynb
09/08/2024  08:47 AM            18,507 tips.csv
01/18/2023  12:57 PM        80,367,441 Truman show.mp3
08/25/2020  03:11 PM       397,080,628 TS.ts
07/15/2023  11:41 AM    <DIR>          venv
08/03/2024  12:12 PM            10,738 web_scraping.ipynb
              29 File(s)    694,304,466 bytes
               9 Dir(s)  59,401,064,448 bytes free

## columns & index

In [6]:
for column in df.columns:
    print(column)

total_bill
tip
sex
smoker
day
time
size
price_per_person
Payer Name
CC Number
Payment ID

In [7]:
df.index

RangeIndex(start=0, stop=244, step=1)

## head & tail

In [8]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251

In [9]:
df.tail(3)

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672

## info & len & describe & transpose

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   total_bill        244 non-null    float64
 1   tip               244 non-null    float64
 2   sex               244 non-null    object
 3   smoker            244 non-null    object
 4   day               244 non-null    object
 5   time              244 non-null    object
 6   size              244 non-null    int64
 7   price_per_person  244 non-null    float64
 8   Payer Name        244 non-null    object
 9   CC Number         244 non-null    int64
 10  Payment ID        244 non-null    object
dtypes: float64(3), int64(2), object(6)
memory usage: 21.1+ KB

In [11]:
len(df)

244

In [12]:
df.describe()

       total_bill         tip        size  price_per_person     CC Number
count  244.000000  244.000000  244.000000        244.000000  2.440000e+02
mean    19.785943    2.998279    2.569672          7.888197  2.563496e+15
std      8.902412    1.383638    0.951100          2.914234  2.369340e+15
min      3.070000    1.000000    1.000000          2.880000  6.040679e+10
25%     13.347500    2.000000    2.000000          5.800000  3.040731e+13
50%     17.795000    2.900000    2.000000          7.255000  3.525318e+15
75%     24.127500    3.562500    3.000000          9.390000  4.553675e+15
max     50.810000   10.000000    6.000000         20.270000  6.596454e+15

In [13]:
df.describe(include='all')

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
count,244.000000,244.000000,244,244,244,244,244.000000,244.000000,244,2.440000e+02,244
unique,NaN,NaN,2,2,4,2,NaN,NaN,244,NaN,243
top,NaN,NaN,Male,No,Sat,Dinner,NaN,NaN,Christy Cunningham,NaN,Thur8084
freq,NaN,NaN,157,151,87,176,NaN,NaN,1,NaN,2
mean,19.785943,2.998279,NaN,NaN,NaN,NaN,2.569672,7.888197,NaN,2.563496e+15,NaN
std,8.902412,1.383638,NaN,NaN,NaN,NaN,0.951100,2.914234,NaN,2.369340e+15,NaN
min,3.070000,1.000000,NaN,NaN,NaN,NaN,1.000000,2.880000,NaN,6.040679e+10,NaN
25%,13.347500,2.000000,NaN,NaN,NaN,NaN,2.000000,5.800000,NaN,3.040731e+13,NaN
50%,17.795000,2.900000,NaN,NaN,NaN,NaN,2.000000,7.255000,NaN,3.525318e+15,NaN
75%,24.127500,3.562500,NaN,NaN,NaN,NaN,3.000000,9.390000,NaN,4.553675e+15,NaN
max,50.810000,10.000000,NaN,NaN,NaN,NaN,6.000000,20.270000,NaN,6.596454e+15,NaN

In [14]:
df.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
total_bill,244.0,1.978594e+01,8.902412e+00,3.070000e+00,1.334750e+01,1.779500e+01,2.412750e+01,5.081000e+01
tip,244.0,2.998279e+00,1.383638e+00,1.000000e+00,2.000000e+00,2.900000e+00,3.562500e+00,1.000000e+01
size,244.0,2.569672e+00,9.510998e-01,1.000000e+00,2.000000e+00,2.000000e+00,3.000000e+00,6.000000e+00
price_per_person,244.0,7.888197e+00,2.914234e+00,2.880000e+00,5.800000e+00,7.255000e+00,9.390000e+00,2.027000e+01
CC Number,244.0,2.563496e+15,2.369340e+15,6.040679e+10,3.040731e+13,3.525318e+15,4.553675e+15,6.596454e+15

# گرفتن داده های یک یا چند ستون

In [5]:
df['mohammad']

0                Mohammad
1     1987-06-27 00:00:00
2     2024-04-27 00:00:00
3               36.835044
4                     NaN
5                Mohammad
6     1987-06-27 00:00:00
7     2030-05-17 00:00:00
8               42.888433
9                     NaN
10               Mohammad
11    1987-06-27 00:00:00
12    2038-05-17 00:00:00
13              50.888433
14                    NaN
15               Mohammad
16    1987-06-27 00:00:00
17    2050-05-17 00:00:00
18              62.888433
Name: mohammad, dtype: object

In [6]:
df[['mohammad','ziba']]

               mohammad                 ziba
0              Mohammad                 Ziba
1   1987-06-27 00:00:00  1990-01-14 00:00:00
2   2024-04-27 00:00:00  2024-04-27 00:00:00
3             36.835044            34.283368
4                   NaN                  NaN
5              Mohammad                 Ziba
6   1987-06-27 00:00:00  1990-01-14 00:00:00
7   2030-05-17 00:00:00  2030-05-17 00:00:00
8             42.888433            40.336756
9                   NaN                  NaN
10             Mohammad                 Ziba
11  1987-06-27 00:00:00  1990-01-14 00:00:00
12  2038-05-17 00:00:00  2038-05-17 00:00:00
13            50.888433            48.336756
14                  NaN                  NaN
15             Mohammad                 Ziba
16  1987-06-27 00:00:00  1990-01-14 00:00:00
17  2050-05-17 00:00:00  2050-05-17 00:00:00
18            62.888433            60.336756

# ایجاد یک ستون جدید

In [4]:
df['percentage_htom']= (df['hasan']/df['mohammad'])*100

TypeError: unsupported operand type(s) for /: 'str' and 'str'